app/Http/Controllers/FornecedorController.php

select * from `fornecedores` order by `created_at` asc limit 5 offset 35
---
    public function index()
    {
        $fornecedor = Fornecedor::orderBy('created_at', 'asc')->paginate(5);
        return view('fornecedor.fornecedores')->with('fornecedores', $fornecedor);

select * from `states`
select * from `cities`
---
    public function create()
    {
        $estados = State::all();
        $cidades = City::all();

delete from `contatos` where `fornecedor_id` = '2'
select * from `fornecedores` where `id` in ('2')
---
    public function destroy($id)
    {
        ContatoAdicional::where('fornecedor_id', '=',$id)->delete();
        Contato::where('fornecedor_id', '=', $id)->delete();
        Fornecedor::destroy($id);

        return redirect('fornecedores')->with('flash_message', 'Student deleted!');