app/Repositories/FornecedorRepository.php

insert into `fornecedores` (`cnpj_cpf`, `razao_social`, `nome_fantasia`, `indicador_estadual`, `inscricao_estadual`, `inscricao_municipal`, `situacao_cnpj`, `recolhimento`, `ativo`, `apelido`, `rg`, `cep`, `logradouro`, `numero`, `complemento`, `bairro`, `ponto_referencia`, `uf`, `cidade`, `condominio`, `observacao`, `updated_at`, `created_at`) values ('26.748.179/0001-53', 'RENATO DE OLIVEIRA LUCENA 01345110693', 'RLUCENA TECNOLOGIA', 'contribuinte', '', '', 'ATIVA', 'recolher', '1', '', '', '74.350-650', 'ALAMEDA FLEURY CURADO', '159', 'APT 1401H;COND VIDA SOL', 'SETOR FAICALVILLE', '', 'GO', 'GOIANIA', 'Não', 'use Exception;use Exception;use Exception;use Exception;', '2023-06-06 16:13:20', '2023-06-06 16:13:20')
---
    public function store(Request $request)
    {
        try {

            $fornecedores = [
                'cnpj_cpf'           => $request->cnpj ?  $request->cnpj :  $request->cpf,
                'razao_social'       => $request->razao_social,
                'nome_fantasia'      => $request->nome_fantasia,
                'indicador_estadual' => $request->ie_indicator,
                'inscricao_estadual' => $request->inscricao_estadual,
                'inscricao_municipal'=> $request->inscricao_minicipal,
                'situacao_cnpj'      => $request->situacao,
                'recolhimento'       => $request->recolhimento,
                'ativo'              => $request->active ? $request->active : $request->ativo,
                'apelido'            => $request->apelido,
                'rg'                 => $request->rg,
                'cep'                => $request->cep,
                'logradouro'         => $request->logradouro,
                'numero'             => $request->numero,
                'complemento'        => $request->complemento,
                'bairro'             => $request->bairro,
                'ponto_referencia'   => $request->ponto_referencia,
                'uf'                 => $request->uf,
                'cidade'             => $request->municipio,
                'condominio'         => $request->condominio,
                'observacao'         => $request->observacao,
            ];

            \Log::debug(json_encode($fornecedores));

            $fornecedor = Fornecedor::create($fornecedores);

insert into `contatos` (`fornecedor_id`, `telefone`, `tipo_telefone`, `email`, `tipo_email`, `updated_at`, `created_at`) values (1, '(62)98430-6136', 'celular', 'cpdrenato@gmail.com', 'Pessoal', '2023-06-06 16:13:20', '2023-06-06 16:13:20')
---
                    'tipo_email'    => $request->tipo_email[$key],
                ];
                \Log::debug(json_encode($dados));
                Contato::create($dados);

insert into `contatos` (`fornecedor_id`, `telefone`, `tipo_telefone`, `email`, `tipo_email`, `updated_at`, `created_at`) values (8, '(41)37810-142', 'comercial', 'teste@coco.net', 'Comercial', '2023-06-07 00:10:54', '2023-06-07 00:10:54')
---
                        'tipo_email_adicional' => $request->tipo_email_adicionais[$key],
                    ];
                    \Log::debug(json_encode($contato_adicional));
                    $contato_adicional = ContatoAdicional::create($contato_adicional);